InformationRegisters/Игра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Игра</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКолонкиТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыХодов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИнформацияПоИгре</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформацияПоИгре</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/НеИспользуетсяхСервер/Ext/Module.bsl
Процедура Вернуть404(Ответ) ЭКСПОРТ
Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
Ответ.КодСостояния=404;
Тело="<!Doctype html"+
		"<html>"+
		"<head>"+
		"</head>"+
		"<body>"+
		"Что-то пошло не так."+
		"</body>"+
		"</html>";
Ответ.УСтановитьТелоИЗСтроки(Тело);
КонецПроцедуры


Функция ПолучитьПользователя(Запрос,Ответ)ЭКСПОРТ
	СыраяСтрока=Запрос.Заголовки.Получить("Cookie");
	Если СыраяСтрока=Неопределено тогда
		Заголовки=Новый Соответствие;
		Заголовки.Вставить("Set-Cookie","user="+Строка(Новый УникальныйИдентификатор())+"; path=/");
		Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
		Ответ.Заголовки= Заголовки;
		
		Тело="<!Doctype html"+
		"<html>"+
		"<head>"+
		"<meta http-equiv=""Refresh"" content=""0;""/> "+
		"</head>"+
		"<body>"+
		"Its ref page";
		Для каждого ключЗнач из Запрос.Заголовки цикл
			Тело=Тело+"<p>"+ключЗнач.ключ +" - " +ключЗнач.Значение +"</p>";
		КонецЦикла;
		Тело=Тело+"</body>"+
		"</html>";
		Ответ.УстановитьТелоИзСтроки(Тело);
		Возврат Неопределено;
	КонецЕсли;
	Пользователь=СтрЗаменить(СыраяСтрока,"user=","");
	Возврат Пользователь;
КонецФункции


Функция МенюИгр() ЭКСПОРТ
Возврат "
|<a href="+Константы.БазовыйПутьКСерверу.Получить()+Метаданные.HTTPСервисы.ох.КорневойURL+Метаданные.HTTPСервисы.ох.ШаблоныURL.ПоказДанныхКлиенту.Шаблон+">Страница со списком игр</a>
|
|
|<br>";
	
КонецФункции

Функция ШаблонТелаСписокИгр() ЭКСПОРТ
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИграСрезПоследних.guid КАК guid,
		|	ИграСрезПоследних.ИмяИгры КАК ИмяИгры,
		|	ИграСрезПоследних.Пользователь1 КАК Пользователь1,
		|	ИграСрезПоследних.Пользователь2 КАК Пользователь2,
		|	ИграСрезПоследних.Ход КАК Ход
		|ИЗ
		|	РегистрСведений.Игра.СрезПоследних КАК ИграСрезПоследних
		|ГДЕ
		|	ИграСрезПоследних.ИграЗакрыта = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Шаблон="<div>Games list<br>";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИдИгры=Строка(ВыборкаДетальныеЗаписи.guid);
		ИмяИгры=Строка(ВыборкаДетальныеЗаписи.ИмяИгры);
		Игрок1=Строка(ВыборкаДетальныеЗаписи.Пользователь1);
		Игрок2=Строка(ВыборкаДетальныеЗаписи.Пользователь2);
		Ход=Строка(ВыборкаДетальныеЗаписи.Ход);

		Шаблон=Шаблон+"<a href="+Константы.БазовыйПутьКСерверу.Получить()+Метаданные.HTTPСервисы.ох.КорневойURL+"/"+ИдИгры+ "><div style=""border: 2px solid black; border-image: none;"">Game: "+ИмяИгры+"<br>" +Игрок1 +" - " +Игрок2+ 
		"<br>Round: "+Ход+"</div></a>";
	КонецЦикла;
	Шаблон=Шаблон+"</div>";
	Возврат Шаблон;	

КонецФункции
